Repository: taku0/lambda_ja
Catalog: lambda_ja-level1.tmx
Source language: en_us
Languages: ja

source: If consistency with encounter order is required, and you are experiencing poor performance or memory utilization with {@code skip()} in parallel pipelines, switching to sequential execution with {@link #sequential()} may improve performance.
ja: もし並列パイプラインにおいて出現順との整合性が必要とされ、{@code skip()}のメモリ使用量の性能が悪い場合、{@link #sequential()}を使って逐次実行に切り換えると性能が向上する場合がある。

source: If executed in parallel, the non-thread-safety of {@code ArrayList} would cause incorrect results, and adding needed synchronization would cause contention, undermining the benefit of parallelism.
ja: 並列に実行した場合、{@code ArrayList}のスレッド非安全性は間違った結果をもたらし、必要な同期を含めるとロック競合が起きて並列性の利点を損なってしまう。

source: If floating-point summation were exact, this method would be equivalent to:
ja: もし浮動小数点の和が正確であれば、このメソッドは次と等価である。

source: If it is not required that results are inserted into the {@code Map} in encounter order, using {@link #toConcurrentMap(Function, Function)} may offer better parallel performance.
ja: もし結果を{@code Map}に出現順に挿入する必要がないならば、{@link #toConcurrentMap(Function, Function)}を使うとより良い並列性能が得られる場合がある。

source: If it is not required that results are merged into the {@code Map} in encounter order, using {@link #toConcurrentMap(Function, Function, BinaryOperator)} may offer better parallel performance.
ja: もし結果を{@code Map}に出現順に併合する必要がないならば、{@link #toConcurrentMap(Function, Function, BinaryOperator)}を使うとより良い並列性能が得られる場合がある。

source: If it is not required that results are merged into the {@code Map} in encounter order, using {@link #toConcurrentMap(Function, Function, BinaryOperator, Supplier)} may offer better parallel performance.
ja: もし結果を{@code Map}に出現順に併合する必要がないならば、{@link #toConcurrentMap(Function, Function, BinaryOperator, Supplier)}を使うとより良い並列性能が得られる場合がある。

source: If multiple threads are depositing results concurrently into a shared container, the order in which results are deposited is non-deterministic.
ja: もし複数のスレッドが結果を並行に共有コンテナに累積していくと、結果が蓄積される順序は非決定的となる。

source: If no elements are present, the result is 0.
ja: 要素が無ければ結果は0となる。

source: If preservation of the order in which elements appear in the resulting {@code Map} collector is not required, using {@link #groupingByConcurrent(Function)} may offer better parallel performance.
ja: もし結果となる{@code Map}コレクタにおいて、要素が出現する順序を保存する必要がない場合、{@link #groupingByConcurrent(Function)}の方が並列性能が良い場合がある。

source: If preservation of the order in which elements are presented to the downstream collector is not required, using {@link #groupingByConcurrent(Function, Collector)} may offer better parallel performance.
ja: もし下流のコレクタに要素を与える順序を保存する必要がない場合、{@link #groupingByConcurrent(Function, Collector)}の方が並列性能が良い場合がある。

source: If preservation of the order in which elements are presented to the downstream collector is not required, using {@link #groupingByConcurrent(Function, Supplier, Collector)} may offer better parallel performance.
ja: もし下流のコレクタに要素を与える順序を保存する必要がない場合、{@link #groupingByConcurrent(Function, Supplier, Collector)}の方が並列性能が良い場合がある。

source: If set, it must be the case that an unchecked cast from A to R will succeed.
ja: もしセットする場合は、AからRへの非チェックキャストは成功する必要がある。

source: If the action accesses shared state, it is responsible for providing the required synchronization.
ja: もしアクションが共有状態を変更するならば、アクションは必要な同期処理を用意する責任を負う。

source: If the action modifies shared state, it is responsible for providing the required synchronization.
ja: もしアクションが共有状態を変更した場合、必要な同期を用意する必要がある。

source: If the behavioral parameters do have side-effects, unless explicitly stated, there are no guarantees as to the visibility of those side-effects to other threads, nor are there any guarantees that different operations on the "same" element within the same stream pipeline are executed in the same thread.
ja: もし挙動パラメータが副作用を持つと、特に明示されない限り他のスレッドに対する副作用の可視性は保障されないし、同じストリームパイプラインの中の「同じ」要素に対する異なる処理が同じスレッドで実行されるという保障もない。

source: If the characteristic {@code IDENTITY_TRANSFORM} is set, this function may be presumed to be an identity transform with an unchecked cast from {@code A} to {@code R}.
ja: もし{@code IDENTITY_FINISH}特性がセットされている場合、この関数は{@code A}から{@code R}への非チェックキャストを伴なう恒等変換と仮定してもよい。

source: If the elements of this stream are not {@code Comparable}, a {@code java.lang.ClassCastException} may be thrown when the terminal operation is executed.
ja: もし要素が{@code Comparable}でなければ、末端処理を実行した際に{@code java.lang.ClassCastException}が投げられる場合がある。

source: If the mapped keys contains duplicates (according to {@link Object#equals(Object)}), an {@code IllegalStateException} is thrown when the collection operation is performed.
ja: もし写像されたキーが({@link Object#equals(Object)}に従って)重複を含む場合は、収集処理が実行される際に{@code IllegalStateException}が発生する。

source: If the mapped keys contains duplicates (according to {@link Object#equals(Object)}), the value mapping function is applied to each equal element, and the results are merged using the provided merging function.
ja: もし写像されたキーが({@link Object#equals(Object)}に従って)重複を含む場合は、等価な各要素に対して値に写像する関数が適用され、用意された併合関数により結果が併合される。

source: If the mapped keys may have duplicates, use {@link #toConcurrentMap(Function, Function, BinaryOperator)} instead.
ja: 写像されたキーが重複を含む場合は代わりに{@link #toConcurrentMap(Function, Function, BinaryOperator)}を使用せよ。

source: If the mapped keys may have duplicates, use {@link #toMap(Function, Function, BinaryOperator)} instead.
ja: 写像されたキーが重複を含む場合は代わりに{@link #toMap(Function, Function, BinaryOperator)}を使用せよ。

source: If the pipeline has more than 253 values, the divisor in the average computation will saturate at 253, leading to additional numerical errors.
ja: もし、パイプラインに253個以上の値がある場合、平均値の計算における分母は253で飽和し、数値計算誤差の増加を引き起こす。

source: If the stream has no encounter order, then any element may be returned.
ja: このストリームが出現順順序を持たなければ任意の要素が返される場合がある。

source: If the stream is empty then {@code false} is returned and the predicate is not evaluated.
ja: このストリームが空であれば、述語は評価されず、{@code false}を返す。

source: If the stream is empty then {@code true} is returned and the predicate is not evaluated.
ja: このストリームが空であれば、述語は評価されず、{@code true}を返す。

source: If the stream is empty, the quantification is said to be vacuously satisfied and is always {@code true} (regardless of P(x)).
ja: このストリームが空の場合、限量子は空虚に満たされる(vacuously satisfied)と言い、(P(x)に依らずに)常に{@code true}となる。

source: If the stream is empty, the quantification is said to be vacuously satisfied and is always {@code true}, regardless of P(x).
ja: このストリームが空の場合、限量子は空虚に満たされる(vacuously satisfied)と言い、(P(x)に依らずに)常に{@code true}となる。

source: If the stream is parallel, and the {@code Collector} is {@link Collector.Characteristics#CONCURRENT concurrent}, and either the stream is unordered or the collector is {@link Collector.Characteristics#UNORDERED unordered}, then a concurrent reduction will be performed (see {@link Collector} for details on concurrent reduction.)
ja: もしストリームが並列で、{@code Collector}が{@link Collector.Characteristics#CONCURRENT 並行的}であり、ストリームが順序を持たないかコレクタが{@link Collector.Characteristics#UNORDERED 順序を持たない}場合、並行簡約が実行される(並行簡約については{@link Collector}を見よ)。

source: If this stream contains fewer than {@code n} elements then an empty stream will be returned.
ja: もしこのストリームが{@code n}より少ない要素を持つ場合、空のストリームが返される。

source: If we wanted to create a collector to tabulate the sum of salaries by department, we could reuse the "sum of salaries" logic using {@link Collectors#groupingBy(Function, Collector)}:
ja: もし部門ごとの給与の合計の表を作るコレクタを作りたいなら、{@link java.util.stream.Collectors#groupingBy(Function, Collector) groupingBy}を利用して「給与の合計」を計算するロジックを再利用できる。

source: If we wanted to take a stream of strings and concatenate them into a single long string, we could achieve this with ordinary reduction:
ja: 例えば、文字列のストリームを受け取り、1つの長い文字列に連結したいとする。これは次のような通常の簡約でも実現できるだろう。

source: If {@code orders} is a stream of purchase orders, and each purchase order contains a collection of line items, then the following produces a stream containing all the line items in all the orders:
ja: 例えば{@code orders}が注文書のストリームであり、各注文書が勘定項目の集合からなる場合、以下のコードは全ての注文の全ての勘定項目を含むストリームを生成する。

source: If {@code path} is the path to a file, then the following produces a stream of the {@code words} contained in that file:
ja: もし{@code path}ファイルへのパスである場合、以下のコードはそのファイルに含まれる単語({@code words})の列を生成する。

source: If {@code widgets} is a collection of {@code Widget} objects, which have a {@code getWeight} method, we can find the heaviest widget with:
ja: もし{@code widgets}が{@code getWeight}メソッドを持つ{@code Widget}オブジェクトのコレクションである場合、最も重いブロックを次ようにして求められる。

source: Implementations of {@link Collector} that implement various useful reduction operations, such as accumulating elements into collections, summarizing elements according to various criteria, etc.
ja: 要素をコレクションに累積する、様々な条件によって要素を要約するなど、様々な便利な簡約処理を実装した{@link Collector}の実装。

source: In addition to the predefined implementations in {@link Collectors}, the static factory methods {@link #of(Supplier, BiConsumer, BinaryOperator, Characteristics...)} can be used to construct collectors.
ja: コレクタの構築には、{@link Collectors}に予め用意された実装に加え、静的ファクトリメソッド{@link #of(Supplier, BiConsumer, BinaryOperator, Characteristics...)}も利用できる。

source: In addition to {@code Stream}, which is a stream of object references, there are primitive specializations for {@link IntStream}, {@link LongStream}, and {@link DoubleStream}, all of which are referred to as "streams" and conform to the characteristics and restrictions described here.
ja: オブジェクトへの参照のストリームである{@code Stream}に加えて、プリミティブ値に特化した{@link IntStream}, {@link LongStream}, {@link DoubleStream}もあり、これらは全てが「ストリーム」と呼ばれ、ここに示される全ての特性と制約を満たす。

source: In almost all cases, terminal operations are eager, completing their traversal of the data source and processing of the pipeline before returning.
ja: 末端処理はほとんどの場合即時的(eagar)であり、値を返す前に情報源の走査とパイプラインの処理を完了する。

source: In cases where the stream has an encounter order, but the user does not particularly care about that encounter order, explicitly de-ordering the stream with {@link java.util.stream.BaseStream#unordered() unordered()} may improve parallel performance for some stateful or terminal operations.
ja: ストリームが出現順順序を持つが、ユーザは特に出現順にこだわらない場合、{@link java.util.stream.BaseStream#unordered() unordered()}を使って明示的にストリームの順序を取り除くと状態を持つ処理や末端処理において並列性能が向上する場合がある。

source: In its more general form, a {@code reduce} operation on elements of type {@code <T>} yielding a result of type {@code <U>} requires three parameters:
ja: より一般的な形式では、{@code <T>}型の要素に対して{@code <U>}型の結果を産出する{@code reduce}処理は3つのパラメータを必要とする。

source: In particular, this method may be implemented using compensated summation or other technique to reduce the error bound in the numerical sum compared to a simple summation of {@code double} values.
ja: 特に、このメソッドは補償付き和や他の技術を使って数値和の誤差の限度を{@code double}値の単純な和と比較して減らすように実装される場合がある。

source: In that case, the parallel invocations of the accumulator could actually deposit their results concurrently into the same shared result container, eliminating the need for the combiner to merge distinct result containers.
ja: その場合、並列に複数起動された累積関数は共有する1つの結果コンテナに結果を累積でき、統合関数が個別の結果コンテナを統合せずに済むようにできるだろう。

source: In this case, the utility method {@link java.util.function.Function#identity()} may be helpful.
ja: その場合、ユーティリティメソッド{@link java.util.function.Function#identity()}が役に立つだろう。

source: In this example, {@code widgets} is a {@code Collection<Widget>}.
ja: この例では{@code widgets}は{@code Collection<Widget>}である。

source: Indicates that the collection operation does not commit to preserving the encounter order of input elements.
ja: 収集処理が入力要素の出現順を保存しようとしないという特性を示す

source: Indicates that the finisher function is the identity function and can be elided.
ja: 仕上げ関数が恒等関数であり、省略可能であるという特性を示す。

source: Indicates that this collector is concurrent, meaning that the result container can support the accumulator function being called concurrently with the same result container from multiple threads.
ja: このコレクタが並行的であるという特性を表す。つまり結果コンテナは累積関数が同じ結果コンテナに対して複数のスレッドから並行的に呼べるような仕様になっているという特性を表す。

source: Intermediate operations are always lazy.
ja: 中間処理は必ず遅延的である。

source: Intermediate operations are further divided into stateless and stateful operations.
ja: 中間処理はさらに状態を持たない(stateless)ものと状態を持つ(stateful)ものに分けられる。

source: Intermediate operations return a new stream.
ja: 中間処理は新しいストリームを返す。

source: It is common for either the key or the value to be the input elements.
ja: キーまたは値が入力要素そのものである場合は多い。

source: It is strongly recommended the spliterator report a characteristic of {@code IMMUTABLE} or {@code CONCURRENT}, or be late-binding.
ja: スプリッテレータは{@code IMMUTABLE}特性か{@code CONCURRENT}特性を示すか、遅延束縛をするよう強く推奨される。

source: Laziness also allows avoiding examining all the data when it is not necessary; for operations such as "find the first string longer than 1000 characters", it is only necessary to examine just enough strings to find one that has the desired characteristics without examining all of the strings available from the source.
ja: また遅延処理は必要でない場合は全てのデータを処理しなくても良いようにできる。例えば「1000文字以上の最初の文字列を探す」といった処理では、情報源にある全ての文字列を調べる必要はなく、目的の性質を持った文字列を探すのに必要な分だけを調べればよい

source: Laziness-seeking.
ja: 遅延的(lazy)であろうとする。

source: Libraries that implement reduction based on {@code Collector}, such as {@link Stream#collect(Collector)}, must adhere to the following constraints:
ja: {@link Stream#collect(Collector)}のように、{@code Collector}に基いて簡約を実装するライブラリは次の制約を遵守する必要がある。

source: Like an {@link java.util.Iterator}, a new stream must be generated to revisit the same elements of the source.
ja: 同じ情報源の同じ要素をもう一度処理したい場合は、{@link java.util.Iterator}と同じように、新しいストリームを生成する必要がある。

source: Like {@link #reduce(Object, BinaryOperator)}, {@code collect} operations can be parallelized without requiring additional synchronization.
ja: {@link #reduce(Object, BinaryOperator)}のように、{@code collect}処理は追加の同期処理を必要とせずに並列化できる。

source: Like {@link #reduce(double, DoubleBinaryOperator)}, {@code collect} operations can be parallelized without requiring additional synchronization.
ja: {@link #reduce(double, DoubleBinaryOperator)}のように、{@code collect}処理は追加の同期処理を必要とせずに並列化できる。

source: Like {@link #reduce(int, IntBinaryOperator)}, {@code collect} operations can be parallelized without requiring additional synchronization.
ja: {@link #reduce(int, IntBinaryOperator)}のように、{@code collect}処理は追加の同期処理を必要とせずに並列化できる。

source: Like {@link #reduce(long, LongBinaryOperator)}, {@code collect} operations can be parallelized without requiring additional synchronization.
ja: {@link #reduce(long, LongBinaryOperator)}のように、{@code collect}処理は追加の同期処理を必要とせずに並列化できる。

source: Low-level stream construction
ja: 低水準ストリーム構築

source: Low-level utility methods for creating and manipulating streams.
ja: ストリームの作成や操作のための低水準ユーティリティメソッド群。

source: Many computations where one might be tempted to use side effects can be more safely and efficiently expressed without side-effects, such as using reduction instead of mutable accumulators.
ja: 副作用を使いたくなるような多くの計算は、可変な累積変数ではなく簡約を利用するなどして、副作用を使わずにより安全で効率的に表現できる。

source: Many reductions using this form can be represented more simply by an explicit combination of {@code map} and {@code reduce} operations.
ja: この形式を使った多くの簡約は{@code map}処理と{@code reduce}処理の明示的な組み合わせによって表現できる。

source: Many stream operations, such as filtering, mapping, or duplicate removal, can be implemented lazily, exposing opportunities for optimization.
ja: 絞り込み・写像・重複の削除といったストリームに対する多くの処理は遅延的に実装でき、最適化の機会をもたらす。

source: May not evaluate the predicate on all elements if not necessary for determining the result.
ja: 結果を特定するのに必要でなければ全ての要素に対しては述語を評価しない。

source: May return itself, either because the stream was already parallel, or because the underlying stream state was modified to be parallel.
ja: このストリームが既に逐次的であるため、または元のストリームの状態を並列であるように変更したため、このストリーム自身を返す場合がある。

source: May return itself, either because the stream was already sequential, or because the underlying stream state was modified to be sequential.
ja: このストリームが既に逐次的であるため、または元のストリームの状態を逐次的であるように変更したため、このストリーム自身を返す場合がある。

source: May return itself, either because the stream was already unordered, or because the underlying stream state was modified to be unordered.
ja: このストリームが既に順序を持たないため、または元のストリームの状態を順序を持たないように変更したため、このストリーム自身を返す場合がある。

source: More formally, the {@code identity} value must be an identity for the combiner function.
ja: より形式的には値{@code identity}は統合関数の単位元である必要がある。

source: Most stream operations accept parameters that describe user-specified behavior, such as the lambda expression {@code w -> w.getWeight()} passed to {@code mapToInt} in the example above.
ja: ほとんどのストリーム処理はユーザが指定する挙動を表わすパラメータを受け取る。上の例において{@code mapToInt}に渡されるラムダ式{@code w -> w.getWeight()}などである。

source: Most stream operations accept parameters that describe user-specified behavior, which are often lambda expressions.
ja: ほとんどのストリーム処理はユーザが指定した挙動を表すパラメータを受け取る。そのパラメータはラムダ式である場合が多い。

source: Most streams are backed by collections, arrays, or generating functions, which require no special resource management.
ja: ほとんどのストリームはコレクション・配列・生成関数が元になっており、特別な資源管理を必要としない

source: Mutable reduction
ja: 可変的簡約

source: Next the list is modified by adding a third string: "three".
ja: 次にリストは3つ目の文字列"three"の追加により変更される。

source: No storage.
ja: 記憶領域を持たない。

source: Non-interference
ja: 非干渉性(Non-interference)

source: Not only is a reduction "more abstract" -- it operates on the stream as a whole rather than individual elements -- but a properly constructed reduce operation is inherently parallelizable, so long as the function(s) used to process the elements are associative and stateless.
ja: ただ単に「より抽象的」である(個別の要素ではなくストリーム全体に対して処理する)というだけでなく、適切に構築された簡約処理は、要素を処理する関数が結合的で状態を持たない限り、本質的に並列化できる。

source: Note also that attempting to access mutable state from behavioral parameters presents you with a bad choice with respect to safety and performance; if you do not synchronize access to that state, you have a data race and therefore your code is broken, but if you do synchronize access to that state, you risk having contention undermine the parallelism you are seeking to benefit from.
ja: 挙動パラメータから可変的な状態にアクセスしようとするのは安全性と効率の面で悪い選択となることにも注意されたい。もしその状態へのアクセスを同期させなければデータ競合(data race)を起こし、したがってコードは正しくなくなるだろう。しかし状態へのアクセスを同期させれば得ようとしている並列性を損なうロック競合(contention)が発生する。

source: Note that if it is important that the elements for a given key appear in the order they appear in the source, then we cannot use a concurrent reduction, as ordering is one of the casualties of concurrent insertion.
ja: もし与えられたキーに対する要素が情報源の中で出現する順序が重要である場合、順序は並行的な挿入によって失なわれる特性の1つなので、並行簡約は使えないことに注意されたい。

source: Numerous other stream-bearing methods in the JDK, including {@link java.util.BitSet#stream()}, {@link java.util.regex.Pattern#splitAsStream(java.lang.CharSequence)}, and {@link java.util.jar.JarFile#stream()}.
ja: {@link java.util.BitSet#stream()}, {@link java.util.regex.Pattern#splitAsStream(java.lang.CharSequence)}, {@link java.util.jar.JarFile#stream()}など、JDKにあるストリーム関連の多数のメソッドから入手する。

source: Of course, such operations can be readily implemented as simple sequential loops, as in:
ja: もちろん、このような処理は簡単な逐次的ループとして次のように難なく実装できる。

source: Once a result is passed to the combiner or finisher function, it is never passed to the accumulator function again.
ja: もし結果が統合関数や仕上げ関数に渡された後は決してそれ以上累積関数にに渡してはいけない。

source: Only the terminal operations {@code iterator()} and {@code spliterator()} are not; these are provided as an "escape hatch" to enable arbitrary client-controlled pipeline traversals in the event that the existing operations are not sufficient to the task.
ja: 末端処理{@code iterator()}と{@code spliterator()}のみ即時的でない。これらは既存の処理が課題に対して十分でない場合にパイプラインの利用者側でコントロールできる任意の走査を可能とするための「逃げ道」として用意されている。

source: Or we could use a parallelizable collect form:
ja: あるいは、並列化可能な収集形式(collect form)で次のようにも書ける。

source: Ordering
ja: 順序

source: Otherwise, {@link #doubleStream(java.util.function.Supplier, int, boolean)} should be used to reduce the scope of potential interference with the source.
ja: そうでなければデータ源との潜在的な干渉が起きる範囲を減らすために{@link #doubleStream(java.util.function.Supplier, int, boolean)}を使うべきである。

source: Otherwise, {@link #intStream(java.util.function.Supplier, int, boolean)} should be used to reduce the scope of potential interference with the source.
ja: そうでなければデータ源との潜在的な干渉が起きる範囲を減らすために{@link #intStream(java.util.function.Supplier, int, boolean)}を使うべきである。

source: Otherwise, {@link #longStream(java.util.function.Supplier, int, boolean)} should be used to reduce the scope of potential interference with the source.
ja: そうでなければデータ源との潜在的な干渉が起きる範囲を減らすために{@link #longStream(java.util.function.Supplier, int, boolean)}を使うべきである。

source: Otherwise, {@link #stream(java.util.function.Supplier, int, boolean)} should be used to reduce the scope of potential interference with the source.
ja: そうでなければデータ源との潜在的な干渉が起きる範囲を減らすために{@link #stream(java.util.function.Supplier, int, boolean)}を使うべきである。

source: Packaging mutable reductions into a Collector has another advantage: composability.
ja: 可変な簡約をCollectorにまとめると他にも利点が得られる。合成可能性である。

source: Parallelism
ja: 並列性

source: Perform the final transformation from the intermediate accumulation type {@code A} to the final result type {@code R}.
ja: 中間累積型{@code A}から最終結果型{@code R}への最終変換を実行する。

source: Performing a reduction operation with a {@code Collector} should produce a result equivalent to:
ja: {@code Collector}を使った簡約処理の実行は次のコードと等価な結果を生成するべきである。

source: Performing the action for one element happens-before performing the action for subsequent elements, but for any given element, the action may be performed in whatever thread the library chooses.
ja: 1つの要素へのアクションは続く要素に対するアクションの実行の前に発生(happens-before)するが、与えられた要素に対してアクションはライブラリが選択した任意のスレッドで実行される。

source: Performs a mutable reduction operation on the elements of this stream using a {@code Collector}.
ja: {@code Collector}を使ってこのストリームの要素に可変的簡約を実行する。

source: Performs a mutable reduction operation on the elements of this stream.
ja: このストリームの要素に可変的簡約を実行する。

source: Performs a reduction on the elements of this stream, using an associative accumulation function, and returns an {@code OptionalDouble} describing the reduced value, if any.
ja: 与えられた結合的な累積関数を使って、このストリームの要素に簡約処理を実行して簡約された値があればそれを表す{@code OptionalDouble}を返す。

source: Performs a reduction on the elements of this stream, using an associative accumulation function, and returns an {@code OptionalInt} describing the reduced value, if any.
ja: 与えられた結合的な累積関数を使って、このストリームの要素に簡約処理を実行して簡約された値があればそれを表す{@code OptionalInt}を返す。

source: Performs a reduction on the elements of this stream, using an associative accumulation function, and returns an {@code OptionalLong} describing the reduced value, if any.
ja: 与えられた結合的な累積関数を使って、このストリームの要素に簡約処理を実行して簡約された値があればそれを表す{@code OptionalLong}を返す。

source: Performs a reduction on the elements of this stream, using an associative accumulation function, and returns an {@code Optional} describing the reduced value, if any.
ja: 与えられた結合的な累積関数を使って、このストリームの要素に簡約処理を実行して簡約された値を表す{@code Optinoal}を返す。

source: Performs a reduction on the elements of this stream, using the provided identity value and an associative accumulation function, and returns the reduced value.
ja: 与えられた単位元と、結合的な累積関数を使って、このストリームの要素に簡約処理を実行して簡約された値を返す。

source: Performs a reduction on the elements of this stream, using the provided identity, accumulation and combining functions.
ja: 与えられた単位元と、累積関数と統合関数を使って、このストリームの要素に簡約処理を実行して簡約された値を返す。

source: Performs an action for each element of this stream, guaranteeing that each element is processed in encounter order for streams that have a defined encounter order.
ja: このストリームの各要素にアクションを適用する。出現順順序が定義されているストリームに対しては各要素は出現順順序で実行されると保障する。

source: Performs an action for each element of this stream, in the encounter order of the stream if the stream has a defined encounter order.
ja: このストリームの各要素にアクションを適用する。もしストリームに出現順順序が定義されていればその出現順順序で実行する。

source: Performs an action for each element of this stream.
ja: このストリームの各要素にアクションを適用する。
